# -*- coding: utf-8 -*-
"""
Created on Fri May 15 11:29:41 2020

@author: cynicos
"""


import random
# =============================================================================
# M=int(input("შეიყვანეთ M: "))
# N=int(input("შეიყვანეთ N: "))
# =============================================================================

# =============================================================================

# 
# i = random.randrange(0, 10)
# print(i)
# Matrix = [[random.randrange(0, 10) for x in range(3)] for y in range(4)] 
# print(Matrix)
# 
# for j in range(3):
#     for i in range(4):
#         Matrix[i][j]
#         print (Matrix[i][j])
# =============================================================================

