# -*- coding: utf-8 -*-
"""
Created on Wed Apr  8 18:17:26 2020

@author: cynicos
"""
#1
# =============================================================================
# numbs = [6, 132, 53, 33, 87]
# print(numbs)
# print(sum(numbs))
# print(min(numbs))
# print(max(numbs))
# print(sum(numbs)/len(numbs))
# 
# numbs.append(112)
# print(numbs)
# 
# numbs.insert(2,205)
# print(numbs)
# 
# numbs.pop(3)
# print(numbs)
# 
# numbs.sort()
# print(numbs)
# =============================================================================

#2

# =============================================================================
# lis=[]
# print("შეიყვანეთ 10 მონაცემი")
# for x in range(10):
#      a=input()
#      lis.append(a)
# print(lis)
# 
# =============================================================================

#8
# =============================================================================
# arr1=(1,2,3,4,5)
# arr2=(5,6,7,8,9)
# def com(a, b): 
#     result=False
#     for x in a: 
#         for y in b: 
#             if x==y: 
#                 result=True
#                 return result  
#     return result 
# 
# print(com(arr1,arr2))
# =============================================================================
    
#10
# =============================================================================
# import random
# x=[6, 132, 53, 33, 87]
# random.shuffle(x)
# print(x)
# =============================================================================

#12
# =============================================================================
# num=input("შეიყვანეთ რიცხვი: ")
# res = [int(x) for x in str(num)] 
# print("რიცხვთა ჯამია: ",sum(res))
# 
# =============================================================================

#13

# =============================================================================
# x=[1, 5, 23, 5, 12, 2, 5, 1, 18, 5]
# print(max(set(x), key=x.count))
# =============================================================================

#16

# =============================================================================
# lis=[]
# print("შეიყვანეთ 10 მონაცემი")
# for x in range(10):
#      a=int(input())
#      lis.append(a)
# print(lis)
# print("საშუალო არითმეტიკული = ",sum(lis)/len(lis))
# 
# n = len(lis) 
# lis.sort() 
# 
# if n % 2 == 0: 
#     median1 = lis[n//2] 
#     median2 = lis[n//2 - 1] 
#     median = (median1 + median2)/2
# else: 
#     median = lis[n//2] 
# print("მედიანა = " + str(median))
# 
# print("მოდა = ",max(set(lis), key=lis.count))
# =============================================================================











